class Texts:
    ##################################                #####################################
    ##################################     Кнопки     #####################################
    ##################################                #####################################
    
    user_button = "📁 Ресурсы"
    admin_button = "👨‍💻 Админка"
    
    back_adm_m = "В главное меню"
    admin_menu_1 = "⛓ Ресурсы"
    admin_menu_2 = "📩 Рассылка"
    admin_newsletter = "Отправьте сообщение для рассылки"
    reg_user = "💎 Зарегистрирован новый пользователь {name}" # {name} - username пользователя 
    
    ##################################                #####################################
    ##################################     Сообщения  #####################################
    ##################################                #####################################
    
    welcome = "Добро пожаловать"
    admin = "👨‍💻 Добро пожаловать в админ панель"